{
  "title": "Resume",
  "content": "\n\n##### Current Developments:\n\nDecember 29th, 2021 Update:\n\nCurrently working in the Security Operations Center at Kiewit. \nObtained the LogRhythm Security Analyst certification last month.\nWorking towards PenTest+ at the moment.\n\n##### Check out my other profiles below:\n\n| [LinkedIn Profile](https://www.linkedin.com/in/brandon-jimenez/) | [Pluralsight Profile](https://app.pluralsight.com/profile/brandon-jimenez-36) | [TryHackMe Profile](https://tryhackme.com/p/darkplisken) | [Hack The Box Profile](https://www.hackthebox.eu/profile/394819) |\n<script src=\"https://tryhackme.com/badge/179064\"></script> <script src=\"https://www.hackthebox.eu/badge/394819\"></script>\n\n\n#### For my resume [click here for a PDF](/app/content/pages/files/BrandonJimenez_Resume(1).pdf), otherwise explore below.\n\n------------------------------------------------------------------------------------\n\n### ABOUT ME\n\nCyber Security Professional with a passion for all things technology, system administration and information security; with 4 years of experience in troubleshooting and supporting a variety of systems. Looking to bring my knowledge gained through certifications, self-study, and professional experience to a Cybersecurity Analyst role within your company.\n\n### TECHNICAL PROFICIENCIES\n\nPLATFORMS: Windows, Linux\n\nTOOLS: Active Directory, Microsoft Office, Bomgar, ServiceNow, SSMS, SCCM, Security Onion\n\nLANGUAGES: HTML, CSS, SQL, Python (Basic)\n\n### RELEVANT SKILLS\nIncident Response, Building Secure Environments, Data Security, Security Policies, Threat Intelligence, Vulnerability\nManagement, Virtualization, Inventory Management, Network/System Troubleshooting\n\n### CERTIFICATIONS\n\nCompTIA Cybersecurity Analyst+ ce\n\nCompTIA Security+ ce \n\nCompTIA Network+ ce \n\nLogRhythm Security Analyst\n\nDell EMC Proven Professional Associate: Information Storage and Management v3\n\n### PROFESSIONAL EXPERIENCE\n\n#### Kiewit Corporation, Omaha, NE\n##### Cyber Security Analyst\nSeptember 2021 - PRESENT\n\nFocus on security operations, incident response and threat intelligence.\n\n- Ensure monitoring of alerts and logs from enterprise security tools such as firewalls, IDS, Anti-virus, Data Loss Protection (DLP) and vulnerability scanners\n- Utilizing LogRhythm and Microsoft Defender, incident response and threat analysis\n- Perform cyber news analysis, security awareness training and recommend new analytic methods for detecting threats\n- Documenting and conforming to processes related to security monitoring and detection\n- Prioritizing workflow; addressing technical and non-technical escalations to satisfaction\n\n##### Technology Group Senior Service Technician\nOctober 2018 - PRESENT\n\nCurrently responsible for preparing and shipping PC's to Kiewit's end users based on information\nsubmitted through our internal ticket system. Focused primarily on the tactical elements of PC diagnostics,\nrepair, and imaging.\n\n- Project Management Lead for troubleshooting efficiencies, operations and maintenance\n- Revitalized Knowledge Base for team distribution; Troubleshooting and Team Policies\n- Auditing software logs to ensure documented guidelines for team process are in line within\nspecifications; ensuring headache-free customer service experience\n- Analyzing and addressing severe hardware issues\n- Abiding to established processes for imaging and repairing computers\n- Facilitating open collaboration with inter-departmental technology teams, optimizing customer\nexperience\n- Maintaining and tracking available PC inventory for a significant portion of the Kiewit Technology Group.\n\n#### First Data, Omaha, NE\n##### Contact Center Technical Specialist\nNovember 2017 - October 2018\n\nWhile working for First Data (now Fiserv) I was responsible for performing routine merchant\naccount-related transactions and was the main point of contact for issues with point of sale systems.\nDuring my tenure I was promoted to Web Portal Payment Support due to my technical proficiency and\ntroubleshooting ability.\n\n- Investigated and resolved a wide variety of technical issues and requests relating to point of sale systems\n- Dynamically upheld PCI Compliance\n- Managed inbound calls for software and POS systems\n- Incident management; restoring services within agreed SLAs\n- Disseminated complex information to tech users of all abilities\n\n### EDUCATION\n\n##### Metropolitan Community College, Omaha, NE — Associate in Applied Science, Server Administration \nNovember 2018\n\n- Became familiar with implementing, configuring, and maintaining a Windows Server\n- Became familiar with implementing and configuring Active Directory environments for organizations of\nall sizes\n- Gained a strong technical foundation in monitoring and managing a network infrastructure\n- Hands on experience setting up a virtualized\n\n### PERSONAL PROJECTS\n##### Homelab\n\nAt home, I have set up my own personal \"home lab\", I use these systems to learn about new technologies and practice new skills. The servers and accompanying systems are very much non-production systems, this allows me free reign on various configurations and test ideas. I use this lab to further commit to self improvement on my down time.\n\n\n- Homebrew KB to document design and configuration\n  - Current setup is utilizing [Material for MkDocs](https://github.com/squidfunk/mkdocs-material). Material is a design theme that is forked from [MkDocs](https://www.mkdocs.org/).\n- Home automation services\n  - Current setup is utilizing [Homebridge](https://homebridge.io/) to connect third party devices into Apple's HomeKit. Automation is being handled by Shortcuts and HomeKit. \n- VMs for learning Windows Server, Ubuntu, Fedora and Kali Linux; virtual networking\n  - VMware Workstation Pro in conjunction with ESXi 6.5 & 6.7\n- Penetration testing\n  - Utilizing primarily Kali Linux on VMWare Workstation Pro to connect and interact with boxes on [TryHackMe](https://tryhackme.com/) and [HackTheBox](https://www.hackthebox.eu/)\n  - Basic python script writing - creating word lists & ping sweep\n"
}